function [Hu] = Humoment(pic)
%HUMOMENT 此处显示有关此函数的摘要
% 此处显示详细说明
[M,N] = size(pic);

%计算图像质心:(I,J)
m00 = sum(sum(pic)); %零阶矩
m01 = 0;              %一阶矩 
m10 = 0;              %一阶矩
for i = 1:M
    for j = 1:N
        m01 = pic(i,j)*j+m01;
        m10 = pic(i,j)*i+m10;
    end
end
I = (m10)/(m00);
J = m01/m00;

%中心矩
u11 = 0;
u20 = 0; u02 = 0;
u30 = 0; u03 = 0;
u12 = 0; u21 = 0;
for i = 1:M
    for j = 1:N
        u20 = pic(i,j)*(i-I)^2+u20;
        u02 = pic(i,j)*(j-J)^2+u02;
        u11 = pic(i,j)*(i-I)*(j-J)+u11;
        u30 = pic(i,j)*(i-I)^3+u30;
        u03 = pic(i,j)*(j-J)^3+u03;
        u12 = pic(i,j)*(i-I)*(j-J)^2+u12;
        u21 = pic(i,j)*(i-I)^2*(j-J)+u21;
    end
end

%规格化中心矩
u20 = u20/m00^2;
u02 = u02/m00^2;
u11 = u11/m00^2;
u30 = u30/m00^(5/2);
u03 = u03/m00^(5/2);
u12 = u12/m00^(5/2);
u21 = u21/m00^(5/2);

%7个Hu不变矩：
n(1) = u20+u02;
n(2) = (u20-u02)^2+4*u11^2;
n(3) = (u30-3*u12)^2+(u03-3*u21)^2;
n(4) = (u30+u12)^2+(u03+u21)^2;
n(5) = (u30-3*u12)*(u30+u12)*((u30+u12)^2-3*(u03-3*u21)^2)+(u03-3*u21)*(u03+u21)*((u03+u21)^2-3*(u30+u12)^2);
n(6) = (u20-u02)*((u30+u12)^2-(u03+u21)^2)+4*u11*(u30+u12)*(u03+u21);
n(7) = (3*u21-u03)*(u30+u12)*((u30+u12)^2-3*(u03-3*u21)^2)+(u30-3*u21)*(u03+u21)*((u03+u21)^2-3*(u30+u12)^2);

% %内部归一化：
en = mean(n);
delta = sqrt(cov(n));
Hu = abs(n-en)/(3*delta);
end

